/**************************** (C) COPYRIGHT 2017 Fortiortech shenzhen *****************************
* File Name          : PWMScan.c
* Author             : Fortiortech Appliction Team
* Version            : V1.0
* Date               : 2017-12-27
* Description        : This file contains main function used for Motor Control.
***************************************************************************************************
* All Rights Reserved
**************************************************************************************************/


/* Includes -------------------------------------------------------------------------------------*/
#include <FU68xx_2.h>
#include <Myproject.h>


/* Private typedef ------------------------------------------------------------------------------*/
/* Private define -------------------------------------------------------------------------------*/
/* Private macro --------------------------------------------------------------------------------*/
/* Private variables ----------------------------------------------------------------------------*/
PWMFREQINPUTTRPE xdata mcPWMFreqInputCtrl;

/* Private function prototypes ------------------------------------------------------------------*/
/* Private functions ----------------------------------------------------------------------------*/

/*-------------------------------------------------------------------------------------------------
	Function Name :	void PWMIN_Init(void)
	Description   :	PWM检测参数初始化
	Input         :	无
	Output		  :	无
-------------------------------------------------------------------------------------------------*/
//void PWMIN_Init(void)
//{
//	memset(&mcPWMFreqInputCtrl,0, sizeof(PWMFREQINPUTTRPE));											// 清零mcPWMFreqInputCtrl
//}

/*-------------------------------------------------------------------------------------------------
	Function Name :	void PWMScan(void)
	Description   : PWM扫描
	Input         :	无
	Output		  :	无
-------------------------------------------------------------------------------------------------*/
void PWMScan(void)
{
	int16 TempFreq1 = 0;
}
